Repository: common-repository/news-wall
Catalog: languages/news-wall-*.po
Languages: fa_ir

source: Notify your users of the latest site news!
fa_ir: کاربر های خود را از آخرین اخبار سایتتان با خبر کنید!

source: latest news
fa_ir: آخرین خبر ها

source: All inputs are required(Except for the user ID) News title must be less than 50 characters
fa_ir: مام فیلد ها اجباری هستند و باید پر شوند(جز آیدی کاربر). هنگام پر کردن فیلد ها به موارد زیر توجه کنید عنوان خبر نمیتواند بیشتر از 50 کاراکتر باشد

source: News Title
fa_ir: عنوان خبر

source: News title
fa_ir: عنوان خبر

source: News Text
fa_ir: متن خبر

source: If you have a problem with the text editor above, do a Google search for the wordpress visual editor not working
fa_ir: اگر مشکلی با ویرایشگر متن بالا(متن خبر) داشتید صفحه را چند بار رفرش کنید، کش صفحه را پاک کنید و در نهایت اگر مشکل همچنان پایدار بود عبارت wordpress visual editor not working را در گوگل جستجو کنید.

source: Send Private News
fa_ir: ارسال خصوصی پیام

source: The ID of the user who receives the private message
fa_ir: آیدی کاربری که میخواهید پیام به شکل خصوصی برایش ارسال شود را وارد کنید

source: If this is public news, do not fill out this input
fa_ir: درصورتی که این یک خبر عمومی است و قرار است به تمام کاربران برسد این فیلد را خالی بگذارید. برای یادگیری نحوه بدست آوردن آیدی کاربران در گوگل جستجو کنید

source: Send News
fa_ir: ثبت خبر

source: An error occurred
fa_ir: مشکلی در ثبت اطلاعات پیش آمد

source: News sent successfully
fa_ir: خبر با موفقیت ثبت شد!

source: Back to home
fa_ir: بازگشت به خانه

source: One or more incorrect inputs have been filled
fa_ir: یک فیلد/چند فیلد به اشتباه پر شده است/ شده اند. ورودی ها:

source: Text:
fa_ir: متن :

source: Title:
fa_ir: عنوان :

source: Do you really want to delete this news?
fa_ir: واقعا میخواهید این خبر را حذف کنید؟

source: Yes
fa_ir: بله

source: No
fa_ir: خیر

source: News deleted
fa_ir: خبر با موفقیت حذف شد

source: The desired news was not found
fa_ir: خبر مورد نظر یافت نشد. ممکن است مشکلی در افزونه یا دیتابیس وجود داشته باشد

source: One or more incorrect inputs have been filled News title must be less than 50 characters
fa_ir: یک فیلد یا چند فیلد اشتباه پر شده اند عنوان خبر باید کمتر از 50 کاراکتر باشد

source: New News
fa_ir: خبر جدید

source: There is no news
fa_ir: خبری برای نمایش وجود ندارد

source: Title
fa_ir: عنوان

source: Date
fa_ir: تاریخ

source: abstract
fa_ir: بخشی از متن

source: Private
fa_ir: خصوصی(آیدی کاربر)

source: processes
fa_ir: عملیات ها

source: edit
fa_ir: ویرایش

source: delete
fa_ir: حذف

source: Help and introduction
fa_ir: معرفی و راهنما

source: Welcome to the News Wall Help page
fa_ir: به صفحه راهنما افزونه دیوار خبر خوش آمدید

source: News Wall is a one-way communication plugin between webmasters and users. Using this plugin, you can inform your users about site news or news related to your sites field of activity.
fa_ir: دیوار اخبار یک افزونه ارتباطی یک طرفه بین مدیران سایت و کاربران است. با استفاده از این افزونه میتوانید کاربران خود را از آخبار های سایت و یا خبر های مرتبط به حوزه فعالیت سایتتان مطلع کنید.

source: How to use
fa_ir: راهنما استفاده

source: This plugin has two short codes.
fa_ir: این افزونه دو کد کوتاه و یا شورت کد دارد

source: To insert a button to display the news summary
fa_ir: برای قرار دادن دکمه نمایش خلاصه خبر ها

source: To display the full news
fa_ir: برای نمایش تمامی خبر ها به صورت کامل

source: guide
fa_ir: راهنمای

source: By inserting this code, a button will appear that you can click on to see some of the latest news (you can change some things in the plugin settings)
fa_ir: بعد از قرار دادن این کد در هر بخش سایت یک دکمه در آن بخش ظاهر میشود که با کلیک بر آن یک بخش ظاهر میشود که 3 تا از جدید ترین اخبار وبسایت در آنجا نمایان میشوند.

source: This short code takes two inputs. The first input is for button arrangement. Left, right and center
fa_ir: این افزونه دو ورودی میگیرد. ورودی اول نحوه چینش دکمه است. Right، Left و Center

source: The second entry is a link that is suggested to be a page where the second code shortcode is used
fa_ir: ورودی دوم یک لینک است که در پایین بخش آخرین خبر ها قرار میگیرد. در صورت پر نکردن این گزینه لینکی نمایش داده نمیشود. اگر ورودی وارد کنید یک لینک با متن مشاهده کامل اخبار ظاهر میشود و کاربر با کلیک بر روی ان لینک به صفحه ای که لینک کرده اید میرود

source: It is not mandatory to enter these inputs
fa_ir: پر کردن این ورودی ها اجباری نیست

source: If you enter entries, your code should end up with something like this: [newswallbtn center google.com]
fa_ir: در نهایت اگر ورودی ها را وارد کنید کد شما باید مانند این نمونه باشد: [newswallbtn center google.com]

source: Sometimes you may save and refresh the page to see changes
fa_ir: گاهی ممکن است تغییرات را به صورت زنده مشاهده نکنید. در چنین زمان هایی برای مشاهده نتیجه کار باید صفحه را ذخیره و تازه سازی(رفرش) کنید.

source: This short code is for displaying news in full. Does not take input
fa_ir: این کد برای نمایش تمامی خبر ها به شکل کامل است. نکته ای در مورد این شورت کد وجود ندارد و ورودی هم نمیگیرد.

source: You can create a page and put this shortcode in it.
fa_ir: شما میتوانید یک صفحه مربوط به خبر ها بسازید و این کد را در ان قرار دهید.

source: Number of news in [newswallbtn]
fa_ir: تعداد خلاصه خبر ها(در [newswallbtn])

source: The title of the news summary section([newswallbtn])
fa_ir: عنوان بخش خلاصه خبر ها([newswallbtn])

source: Title of all news section([newswallpage])
fa_ir: عنوان بخش تمام خبر ها([newswallpage])

source: Submit changes
fa_ir: ثبت تغییرات

source: The desired news was updated. Refresh the page to see changes
fa_ir: تغییرات با موفقیت ثبت شد. برای مشاهده تغییرات صفحه را رفرش کنید

source: there was a problem. In general, there are three possibilities: 1- The information entered is duplicate 2- There is a problem in the database 3- There is a problem with the plugin code.
fa_ir: در ثبت اطلاعات مشکلی پیش آمد. به صورت کلی سه احتمال وجود دارد: 1- اطلاعات وارد شده تکراری است 2- مشکلی در دیتابیس وجود دارد 3- مشکلی در کد های افزونه وجود دارد.

source: News Wall
fa_ir: دیوار خبر

source: News - News Wall
fa_ir: اخبار - دیوار خبر

source: News
fa_ir: اخبار

source: Settings - Newswall
fa_ir: تنظیمات - دیوار خبر

source: Settings
fa_ir: تنظیمات

source: Help and introduction - Newswall
fa_ir: معرفی و راهنمایی - دیوار خبر

source: See all news
fa_ir: معرفی و راهنمایی
